# Task 1

---

## Web scraping and analysis

This Jupyter notebook includes some code to get you started with web scraping. We will use a package called `BeautifulSoup` to collect the data from the web. Once you've collected your data and saved it into a local `.csv` file you should start with your analysis.

### Scraping data from Skytrax

If you visit [https://www.airlinequality.com] you can see that there is a lot of data there. For this task, we are only interested in reviews related to British Airways and the Airline itself.

If you navigate to this link: [https://www.airlinequality.com/airline-reviews/british-airways] you will see this data. Now, we can use `Python` and `BeautifulSoup` to collect all the links to the reviews and then to collect the text data on each of the individual review links.

In [8]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
base_url = "https://www.airlinequality.com/airline-reviews/british-airways"
pages = 10
page_size = 100

reviews = []

# for i in range(1, pages + 1):
for i in range(1, pages + 1):

    print(f"Scraping page {i}")

    # Create URL to collect links from paginated data
    url = f"{base_url}/page/{i}/?sortby=post_date%3ADesc&pagesize={page_size}"

    # Collect HTML data from this page
    response = requests.get(url)

    # Parse content
    content = response.content
    parsed_content = BeautifulSoup(content, 'html.parser')
    for para in parsed_content.find_all("div", {"class": "text_content"}):
        reviews.append(para.get_text())
    
    print(f"   ---> {len(reviews)} total reviews")

Scraping page 1
   ---> 100 total reviews
Scraping page 2
   ---> 200 total reviews
Scraping page 3
   ---> 300 total reviews
Scraping page 4
   ---> 400 total reviews
Scraping page 5
   ---> 500 total reviews
Scraping page 6
   ---> 600 total reviews
Scraping page 7
   ---> 700 total reviews
Scraping page 8
   ---> 800 total reviews
Scraping page 9
   ---> 900 total reviews
Scraping page 10
   ---> 1000 total reviews

In [5]:
df = pd.DataFrame()
df["reviews"] = reviews
df.head()

                                             reviews
0  ✅ Trip Verified |  British Airways has a total...
1  ✅ Trip Verified | London Heathrow to Keflavik,...
2  ✅ Trip Verified | Mumbai to London Heathrow in...
3  ✅ Trip Verified |  Care and support shocking. ...
4  ✅ Trip Verified |  Flying A380 business class ...

In [7]:
df.to_csv("data/BA_reviews.csv")

Congratulations! Now you have your dataset for this task! The loops above collected 1000 reviews by iterating through the paginated pages on the website. However, if you want to collect more data, try increasing the number of pages!

 The next thing that you should do is clean this data to remove any unnecessary text from each of the rows. For example, "✅ Trip Verified" can be removed from each row if it exists, as it's not relevant to what we want to investigate.

In [14]:
reviews_df = pd.read_csv("data/BA_reviews.csv")
reviews_df.head()

   Unnamed: 0                                            reviews
0           0  ✅ Trip Verified |  British Airways has a total...
1           1  ✅ Trip Verified | London Heathrow to Keflavik,...
2           2  ✅ Trip Verified | Mumbai to London Heathrow in...
3           3  ✅ Trip Verified |  Care and support shocking. ...
4           4  ✅ Trip Verified |  Flying A380 business class ...

In [13]:
reviews_df.columns

Index(['Unnamed: 0', 'reviews'], dtype='object')

In [20]:
reviews_df.duplicated().sum()
reviews_df.describe()

        Unnamed: 0
count  1000.000000
mean    499.500000
std     288.819436
min       0.000000
25%     249.750000
50%     499.500000
75%     749.250000
max     999.000000

In [23]:
# Clean data to remove unnecessary text
import re
reviews_df.replace(re.compile(r'\s*✅ Trip Verified \|\s*'), '', inplace=True)
reviews_df

     Unnamed: 0                                            reviews
0             0  British Airways has a total lack of respect fo...
1             1  London Heathrow to Keflavik, Iceland in Busine...
2             2  Mumbai to London Heathrow in Business Class on...
3             3  Care and support shocking. Written by a previo...
4             4  Flying A380 business class should be a pleasur...
..          ...                                                ...
995         995  Business Class space is ridiculously narrow. S...
996         996  Aberdeen to Heathrow to connect to a flight in...
997         997  I would not recommend this airline. I travel a...
998         998  New York to Budapest via London. The second fl...
999         999  Heathrow to Athens on A321. Arrived at the air...

[1000 rows x 2 columns]

In [35]:
cleaned_df = reviews_df.drop(["Unnamed: 0"], axis=1)
cleaned_df

                                               reviews
0    British Airways has a total lack of respect fo...
1    London Heathrow to Keflavik, Iceland in Busine...
2    Mumbai to London Heathrow in Business Class on...
3    Care and support shocking. Written by a previo...
4    Flying A380 business class should be a pleasur...
..                                                 ...
995  Business Class space is ridiculously narrow. S...
996  Aberdeen to Heathrow to connect to a flight in...
997  I would not recommend this airline. I travel a...
998  New York to Budapest via London. The second fl...
999  Heathrow to Athens on A321. Arrived at the air...

[1000 rows x 1 columns]

In [33]:
#Save cleaned dataframe to CSV
cleaned_df.to_csv("data/BA_cleaned.csv", index=False)

In [34]:
cleaned_df.head()

                                             reviews
0  British Airways has a total lack of respect fo...
1  London Heathrow to Keflavik, Iceland in Busine...
2  Mumbai to London Heathrow in Business Class on...
3  Care and support shocking. Written by a previo...
4  Flying A380 business class should be a pleasur...